Raw-wrk-files/run-1/fortune/aspnet-sqlserver-entityframework/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Tue Oct 15 13:01:53 PDT 2013

  System load:  0.0                Processes:           116
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 0%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

52 packages can be updated.
19 updates are security updates.


---------------------------------------------------------
 Running Primer aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 5s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.36ms   11.51ms  45.37ms   90.85%
    Req/Sec   533.94    180.86   777.00     87.11%
  19938 requests in 5.00s, 33.33MB read
Requests/sec:   3987.01
Transfer/sec:      6.67MB

---------------------------------------------------------
 Running Warmup aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.44ms   21.99ms 361.29ms   76.91%
    Req/Sec     0.90k    95.15     1.11k    65.84%
  106761 requests in 15.02s, 178.48MB read
Requests/sec:   7110.27
Transfer/sec:     11.89MB

---------------------------------------------------------
 Concurrency: 8 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.74ms    9.77ms  39.08ms   91.35%
    Req/Sec   535.65    180.53   777.00     86.84%
  60650 requests in 15.00s, 101.39MB read
Requests/sec:   4043.15
Transfer/sec:      6.76MB

---------------------------------------------------------
 Concurrency: 16 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.33ms   14.57ms  51.11ms   88.12%
    Req/Sec     0.93k   389.19     1.55k    79.17%
  104074 requests in 15.00s, 173.99MB read
Requests/sec:   6937.98
Transfer/sec:     11.60MB

---------------------------------------------------------
 Concurrency: 32 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.13ms   14.26ms 120.83ms   91.87%
    Req/Sec     0.91k   359.94     1.60k    69.82%
  104619 requests in 15.00s, 174.90MB read
Requests/sec:   6974.30
Transfer/sec:     11.66MB

---------------------------------------------------------
 Concurrency: 64 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.49ms    9.69ms 119.11ms   89.45%
    Req/Sec     0.89k   177.87     1.38k    66.51%
  103955 requests in 15.00s, 173.79MB read
Requests/sec:   6930.22
Transfer/sec:     11.59MB

---------------------------------------------------------
 Concurrency: 128 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.94ms   15.86ms 246.90ms   87.56%
    Req/Sec     0.87k   149.05     1.28k    69.73%
  103163 requests in 15.00s, 172.47MB read
Requests/sec:   6876.97
Transfer/sec:     11.50MB

---------------------------------------------------------
 Concurrency: 256 for aspnet-sqlserver-entityframework
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://172.16.98.122:8080/entityframework/sqlserver/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/entityframework/sqlserver/fortunes
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.75ms   25.08ms 317.41ms   77.31%
    Req/Sec     0.88k    99.48     1.10k    68.61%
  104599 requests in 15.00s, 174.87MB read
Requests/sec:   6972.41
Transfer/sec:     11.66MB